#include "led.h"
/***************************************************************
* 文件名称: KEY
* 作    者: 物联网俱乐部
* 版    本: V1.0
* 编写日期: 2018-9-1
* 功    能: LED开关灯操作
****************************************************************
* 硬件平台: 本例程配套物联网俱乐部EVB_M1开发板使用
* 淘    宝: iot-club.taobao.com、https://shop449662000.taobao.com
* 论    坛: www.iot-club.cn 、bbs.iot-club.cn
****************************************************************/
LED_STATUS ledStatus;

/***************************************************************
* 函数名称: LED初始化
* 说    明: 使用HAL库，直接在GPIO初始化里做了，MX_GPIO_Init();
* 参    数: 无
* 返 回 值: 无
***************************************************************/

/***************************************************************
* 函数名称: LED_Set
* 说    明: LED控制
* 参    数: status：LED_ON-开灯	LED_OFF-关灯
* 返 回 值: 无
***************************************************************/
void LED_Set(LED_ENUM status)
{
	HAL_GPIO_WritePin(LED_GPIO_Port,LED_Pin,status != LED_ON ? GPIO_PIN_RESET : GPIO_PIN_SET );
	ledStatus.led1_Sta = status;	
}
